In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
from IPython.display import display

pd.set_option('display.max_rows', None)
PATH = "Ohio Contributions - Contributions.csv"

In [2]:
df = pd.read_csv(PATH)
df.head(5)

,candidate_id,candidate,contributor_name,contributor_state,contributor_occupation,amount,date
0,P80000748,"Paul, Ron","BROWN, TODD W MR.",OH,ENGINEER,50.0,6/12/2011
1,P80000748,"Paul, Ron","DIEHL, MARGO SONJA",OH,RETIRED,25.0,6/12/2011
2,P80000748,"Paul, Ron","KIRCHMEYER, BENJAMIN",OH,COMPUTER PROGRAMMER,201.2,6/12/2011
3,P80003338,"Obama, Barack","KEYES, STEPHEN",OH,HR EXECUTIVE / ATTORNEY,100.0,30/9/2011
4,P80003338,"Obama, Barack","MURPHY, MIKE W",OH,MANAGER,50.0,26/9/2011

In [3]:
df.shape

(151479, 7)

In [4]:
df["contributor_occupation"].describe()

count      150481
unique       6843
top       RETIRED
freq        38151
Name: contributor_occupation, dtype: object

In [5]:
df_tmp = df["contributor_occupation"]\
    .value_counts().rename_axis('contributor_occupation').reset_index(name='counts')
df_tmp.head(10)

                   contributor_occupation  counts
0                                 RETIRED   38151
1  INFORMATION REQUESTED PER BEST EFFORTS    5778
2                               HOMEMAKER    4674
3                               PHYSICIAN    4458
4                                ATTORNEY    4056
5                   INFORMATION REQUESTED    3819
6                               PROFESSOR    3380
7                                 TEACHER    2686
8                                ENGINEER    1910
9                                 MANAGER    1592

In [6]:
df_tmp.to_csv("new.csv",index=False)

In [7]:
df2 = pd.read_csv("new.csv")
df2.head(10)

                   contributor_occupation  counts
0                                 RETIRED   38151
1  INFORMATION REQUESTED PER BEST EFFORTS    5778
2                               HOMEMAKER    4674
3                               PHYSICIAN    4458
4                                ATTORNEY    4056
5                   INFORMATION REQUESTED    3819
6                               PROFESSOR    3380
7                                 TEACHER    2686
8                                ENGINEER    1910
9                                 MANAGER    1592